// 변수명

// 다음 중 변수명으로 사용할 수 없는 것 2개를 고르시오.
// 1) age
// 2) Age
// 3) let
// 4) _age
// 5) 1age

// 답안
// 3), 5)

// let은 문법적인 용도로 사용하고 있는 예약어이므로 사용할 수 없으며
// 변수명은 숫자로 시작할 수 없다.

// 자바스크립트 변수명 생성 규칙

// 1. 변수명에는 오직 문자, 숫자, 기호 $와 _만 들어갈 수 있다.
//    ($와 _는 사용을 자제하고 함수와 구분하기 쉽도록 명사를 첫 단어로 사용한다.)
// 2. 첫글자로 숫자를 쓸 수 없다.
// 3. 예약어를 사용할 수 없다.
// 4. 대소문자를 구별한다.

// - 그 외에도 암묵적인 룰이 몇 가지 있다.
// 1. 영어로 작성한다.
// 2. 여러 단어를 조합해 변수명을 만들 때는 카멜표기법을 사용한다.
// 3. 상수는 대문자 스네이크 표기법을 사용한다.
// 4. 전역변수를 사용하지 않는다. (암묵적 전역변수 사용에 유의)
// 5. 지역변수 혹은 private 변수는 _로 시작한다.